<template>
  <div class="agreement">
    <div class="agreement_title">
      <h1>欢迎注册并使用麦创所提供的服务。本协议是由江苏有麦科技服务有限公司公司(以下简称我公司)与用户(指注册、登录、使用本服务的个人，以下有时称为“您”)就麦创(以下简称“本产品”)提供的服务所订立的相关权利义务规范</h1>
    </div>
    <div class="agreement_box">
      <div class="agreement_box_title">
        <p>一、总则</p>
      </div>
      <div class="agreement_box_content">
        <p>1、用户在注册及使用前请认真阅读本协议，确保充分理解本协议中所有条款。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为无条件接受本协议所有条款的约束。</p>
        <p>2、除非另有明确规定，本产品所推出的新功能、新服务，均无条件的使用本协议。</p>
        <p>3、我公司保留在任何时候修改本协议条款的权利，且无需另行通知。在我公司修改协议条款后，如果您不接受修改后的条款，请立即停止使用本产品提供的服务，继续使用本产品提供的服务将被视为接受修改后的协议。</p>
      </div>
    </div>
    <div class="agreement_box">
      <div class="agreement_box_title">
        <p>三、服务内容</p>
      </div>
      <div class="agreement_box_content">
        <p>1、本服务的具体内容由本产品根据实际情况提供，本产品可以对提供的服务予以变更，且本产品提供的服务内容可能随时变更，用户将会收到关于服务变更的通知。</p>
        <p>2、除非本协议另有其他明示规定，本公司所推出的新产品、新功能、新服务，均受到本协议条款之规范。</p>
      </div>
    </div>
    <div class="agreement_box">
      <div class="agreement_box_title">
        <p>四、服务变更、中断或终止</p>
      </div>
      <div class="agreement_box_content">
        <p>1、鉴于网络服务的特殊性(包括但不限于服务器的稳定性问题、恶意的网络攻击等行为的存在及其他无法控制的情形)，用户同意我公司有权随时中断或终止部分或全部的服务；</p>
        <p>2、我公司需要定期或不定期地对提供服务的系统或相关设备进行检修或维护，如因此类情况而造成服务在合理时间内的中断，我公司无需为此承担任何责任； </p>
        <p>3、如发生下列任何一种情形，我公司有权随时变更、中断或终止向用户提供本协议项下的服务而无需对用户或任何第三方承担任何责任：</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
</style>